web/WEB-INF/wsit-insa.ws.ManageWS.xml

<?xml version="1.0" encoding="UTF-8"?> 
 <definitions 
 xmlns="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="ManageWS" targetNamespace="http://ws.insa/" xmlns:tns="http://ws.insa/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:fi="http://java.sun.com/xml/ns/wsit/2006/09/policy/fastinfoset/service" xmlns:tcp="http://java.sun.com/xml/ns/wsit/2006/09/policy/soaptcp/service" xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" 
 >
    <message name="addUserProfile"/>
    <message name="addUserProfileResponse"/>
    <message name="debugInitDatabase"/>
    <message name="debugInitDatabaseResponse"/>
    <portType name="ManageWS">
        <operation name="addUserProfile">
            <input message="tns:addUserProfile"/>
            <output message="tns:addUserProfileResponse"/>
        </operation>
        <operation name="debugInitDatabase">
            <input message="tns:debugInitDatabase"/>
            <output message="tns:debugInitDatabaseResponse"/>
        </operation>
    </portType>
    <binding name="ManageWSPortBinding" type="tns:ManageWS">
        <wsp:PolicyReference URI="#ManageWSPortBindingPolicy"/>
        <operation name="addUserProfile">
            <input/>
            <output/>
        </operation>
        <operation name="debugInitDatabase">
            <input/>
            <output/>
        </operation>
    </binding>
    <service name="ManageWS">
        <port name="ManageWSPort" binding="tns:ManageWSPortBinding"/>
    </service>
    <wsp:Policy wsu:Id="ManageWSPortBindingPolicy">
        <wsp:ExactlyOne>
            <wsp:All/>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="ManageWSPortBinding_hello_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="ManageWSPortBinding_hello_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="ManageWSPortBinding_wsHello_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="ManageWSPortBinding_wsHello_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
</definitions>
